package ru.job4j.Job4.execises.Loop;

public class BackwardFor {
    public static void out(int m,int n){
        for(int index = m; index > n; index --){
            System.out.println(index);
        }

    }
}
/*
* 4. Вывести на консоль числа от M до N.
Нужно вывести числа от M до N. N не включено. M > N.
* */