package ru.job4j.Job4.execises.Loop;

public class Hamming {
    public static int checkStrings(String left, String right) {
        int counter = 0;
        for(int i = 0; i<left.length();i++){
            /*Сравниваем символы строк left and right*/
            if(left.charAt(i) != right.charAt(i)){
                counter ++;
            }
        }
        return counter;
    }
}
/*
* 10. Расстояние Хэмминга
Расстояние Хэмминга - это число позиций в которых соответствующие
*  символы двух слов одинаковой длины различны.
Например, сравнивая "101010111" и "111010100" мы должны получить - 3,
* поскольку не равны символы (отмечены красными) - "101010111" и "111010100"
Метод принимает 2 строки, всегда одинаковой длины. Необходимо
*
* определить для строки расстояние Хэмминга. Для этого в цикле
*  последовательно необходимо сравнивать символы в строке. Для
* извлечения символа из строки используйте метод charAt(int index)
*  класса String.*/