package ru.job4j.Job4.execises.Loop;

public class Print0ToN {
    public static void out(int n){
        for (int index = 0; index < n; index++) {
            System.out.println(index);
        }
    }
}
/*
* 1. Вывести на консоль числа от 0 до N
Выведите на консоль числа от 0 до N. N не входит. В этом упражнении используйте цикл for c index.
* */
