package ru.job4j.Job4.execises.Loop;

public class PrintNToM {
    public static void out(int n, int m) {
        for (int index = n; index < m; index++) {
            System.out.println(index);
        }
    }
}
/*
* 2. Вывести на консоль числа от N до M
Выведите на консоль числа от N до M. M не входит. В этом упражнении используйте цикл for c index.
* */